In [1]:
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func, MetaData

In [2]:
import pandas as pd

In [3]:
from flask import Flask, jsonify

In [4]:
import sqlite3
conn = sqlite3.connect("my_data.db")
c = conn.cursor()

In [7]:
data = c.execute('''SELECT * FROM data_salaries WHERE company_location = 'IL' ''').fetchall()

In [8]:
data

[(2023,
  'SE',
  'FT',
  'AI Scientist',
  1500000,
  'ILS',
  423834,
  'IL',
  0,
  'IL',
  'L'),
 (2021,
  'MI',
  'FT',
  'Data Scientist',
  160000,
  'SGD',
  119059,
  'SG',
  100,
  'IL',
  'M')]

In [9]:
# groupby country
country_data = c.execute('''Select company_location, AVG(salary_in_usd),AVG(remote_ratio), COUNT(company_location) as count FROM data_salaries GROUP BY company_location''').fetchall()
pd.DataFrame(country_data)

     0              1           2     3
0   AE  100000.000000   66.666667     3
1   AL   10000.000000   50.000000     1
2   AM   50000.000000    0.000000     1
3   AR   25000.000000  100.000000     3
4   AS   29351.000000   66.666667     3
..  ..            ...         ...   ...
67  TH   23064.333333   66.666667     3
68  TR   19058.000000   40.000000     5
69  UA   57850.000000   37.500000     4
70  US  151822.009539   44.440789  3040
71  VN   12000.000000    0.000000     1

[72 rows x 4 columns]